In [43]:
import pandas as pd

In [44]:
df = pd.read_excel(r'E:\New folder\TASK -- convert raw data - clean data.xlsx')

In [45]:
df

                                          ADDR         DT NAME     time
0  45 rd, kenith street, btm, bangalore 500038 2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd 500038 2022-04-02  dec  5:30:21

In [46]:
df['ADDR']

0    45 rd, kenith street, btm, bangalore 500038
1              45 rd,  street, hitech, Hd 500038
Name: ADDR, dtype: object

In [47]:
df[['HouseNO', 'Locality', 'City', 'PIN']] = df['ADDR'].str.extract(r'^(.*?),\s*(.*?),\s*(.*?)(?:,?\s*(\d{6}))?$')

In [48]:
df

,ADDR,DT,NAME,time,HouseNO,Locality,City,PIN
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,"btm, bangalore",500038
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,"hitech, Hd",500038

In [49]:
df['DT']

0   2022-04-03
1   2022-04-02
Name: DT, dtype: datetime64[ns]

In [50]:
df['Year'] = df['DT'].dt.year
df['Month'] = df['DT'].dt.month
df['Day'] = df['DT'].dt.day

In [51]:
df

,ADDR,DT,NAME,time,HouseNO,Locality,City,PIN,Year,Month,Day
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,"btm, bangalore",500038,2022,4,3
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,"hitech, Hd",500038,2022,4,2

In [52]:
df.columns

Index(['ADDR', 'DT', 'NAME', 'time', 'HouseNO', 'Locality', 'City', 'PIN',
       'Year', 'Month', 'Day'],
      dtype='object')

In [56]:
df = df.drop(columns = ['ADDR'])

In [57]:
df

,DT,NAME,time,HouseNO,Locality,City,PIN,Year,Month,Day
0,2022-04-03,abc,8:30:21,45 rd,kenith street,"btm, bangalore",500038,2022,4,3
1,2022-04-02,dec,5:30:21,45 rd,street,"hitech, Hd",500038,2022,4,2

In [62]:
df = df.drop(columns=['DT'])

In [63]:
df

,NAME,time,HouseNO,Locality,City,PIN,Year,Month,Day
0,abc,8:30:21,45 rd,kenith street,"btm, bangalore",500038,2022,4,3
1,dec,5:30:21,45 rd,street,"hitech, Hd",500038,2022,4,2